app/controllers/api/servers_controller.rb

INSERT INTO "servers" ("owner_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["owner_id", 1], ["name", "rhsjjjjjaj"], ["created_at", "2019-11-12 22:12:30.352331"], ["updated_at", "2019-11-12 22:12:30.352331"]]
---
    def create
        @server = Server.new(server_params)
        @server.owner_id = current_user.id

        if @server.save

DELETE FROM "servers" WHERE "servers"."id" = $1  [["id", 6]]
---
    def destroy
        @server = current_user.servers.find_by(id: params[:id])
        if @server
            @server.delete