app/controllers/servers_controller.rb

    def show
        @server = Server.find_by(id: params[:id])
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def index
        @servers = Server.find_by(owner_id: params[:ownerId])
---
SELECT  "servers".* FROM "servers" WHERE "servers"."owner_id" = $1 LIMIT $2  [["owner_id", 2], ["LIMIT", 1]]

    def create
        @server = Server.new(server_params)
        @server.owner_id = current_user.id

        if @server.save
---
INSERT INTO "servers" ("owner_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["owner_id", 1], ["name", "#1 server yay"], ["created_at", "2019-11-12 17:15:49.902069"], ["updated_at", "2019-11-12 17:15:49.902069"]]

    def destroy
        @server = Server.find_by(id: params[:id])
        if @server
            @server.delete
---
SELECT  "servers".* FROM "servers" WHERE "servers"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "servers" WHERE "servers"."id" = $1  [["id", 6]]