app/controllers/servers_controller.rb

INSERT INTO "servers" ("owner_id", "name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["owner_id", 1], ["name", "primeiro"], ["created_at", "2019-11-10 20:43:17.492389"], ["updated_at", "2019-11-10 20:43:17.492389"]]
---
    def create
        @server = Server.new(server_params)
        @server.owner_id = current_user.id

        if @server.save